Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F31A.tmx
Source language: en_us
Languages: zh_cn

source: The saddle saga: saddling up and setting off
zh_cn: 单车传奇：从伦敦到悉尼的骑行——终于出发了

source: I don't speak much French. This becomes apparent as I struggle to order a celebratory drink on board the Sea France ferry from Dover to Calais.
zh_cn: 我只会一点法语，当我登上从多佛到加莱的“法国海洋”号渡船，在船上点一杯欢迎饮料时，这一点就显露出来了。

source: The barman treats my attempts with the same disdain as my year 9 French teacher had.
zh_cn: 酒吧侍应生对我颇为不屑，就像我九年级的法语教师对我那样。

source: The next few days' cycling through France and Belgium should prove interesting.
zh_cn: 看来接下来几天在法国和比利时的骑行会有点意思。

source: Our last night in London had been frantic.
zh_cn: 我们在伦敦的最后一夜忙乱不堪。

source: Last-minute details and outstanding tasks - like condensing our lives down to four pannier bags - were finally completed at 2.30am.
zh_cn: 临行前的所有细节和没做完的事情——我们似乎要把我们的全部生活都浓缩进四个自行车驼篮里，最后忙到凌晨2：30才算大功告成。

source: I hit the sack, too excited and nervous to sleep in the hours until Matt and I were to leave on our cycle journey to the other side of the world.
zh_cn: 我上了床，但是由于过份激动和紧张以至无法入睡，直到我和迈特开始我们前往世界另外一面的骑车旅行。

source: The panic continued next morning when, halfway into London, I realised I'd forgotten my tent at my flat.
zh_cn: 这种忙乱持续到次日上午，在到伦敦的半路上，我才想起把帐篷忘记在家里。

source: Regardless, I made it to Trafalgar Square just in time to meet our friends and relatives who'd gathered to see us off.
zh_cn: 尽管如此，我还是及时赶到了特拉法加广场，亲友们都集聚在那里欢送我们。

source: Thirteen of the crowd would act as our farewell peloton and accompany us all the way to our first stop - 65 miles to the not-too-exotic Canterbury camping site.
zh_cn: 其中有十三人将陪同我们到第一站——65英里外还没有异国风情的坎特伯雷营地。

source: Posing for myriad photos did not sit well with our nerves.
zh_cn: 摆姿势拍了很多照片，但这并没有缓解我们的紧张心情。

source: After a year-and-a-half of planning, saving and talking, the moment for us to finally leave had come.
zh_cn: 我们计划了一年半，不断地筹备和讨论，现在出发的时刻终于来到了。

source: We both felt the lure of the open road.
zh_cn: 我们都感到前面的漫漫长途在吸引着我们。

source: The sun came out as we set off, which made for an uncomfortably hot ride along the A2.
zh_cn: 出发的时候太阳出来了，在沿着A2公路骑行时热得很不舒服。

source: This was a mistake as, unlike other European motorists we've encountered, British drivers don't often show much courtesy towards cyclists; a few of the group were even happy-slapped by some kids in a passing car.
zh_cn: 选择A2是个错误，因为不像在其它欧洲国家那样，英国的司机们对自行车手不是那么礼让，有些车手甚至会被经过车上的孩子用手拍上几下。

source: Stopping for lunch after 35 miles, I found that I was shaking from tiredness, this being my first real ride with 66 lbs of kit strapped to the bike.
zh_cn: 骑了35英里后停车吃午饭，我感到自己由于疲劳而颤抖，这是我第一次带了66磅装备骑行。

source: Matt looked fine (sunburn aside) and still wore the same grin he'd had from the start.
zh_cn: 迈特除了被阳光灼伤外一切都好，他像出发时那样脸上仍带着微笑。

source: The final miles were less taxing on our legs and spirits, and we all made it to the campsite tired, sun-kissed and more than ready for a cold beer and pizza.
zh_cn: 最后数英里的骑行，我们的腿部和精神都不感到那么费力了。到达营地后我们都很疲劳，皮肤被太阳晒得发红，能喝上冰啤酒，吃上披萨饼是再好不过了。

source: We spent our last evening in the company of our friends, discussing the journey ahead.
zh_cn: 我们和朋友们一起度过了最后一夜，大家谈论着前面的旅程。

source: It was reassuring to hear Matt admitting to a certain sense of uncertainty: we both felt excited and happy to finally be on the road, but equally shared a fear of what lay ahead.
zh_cn: 听到迈特也感觉心中没底，我安心了。我们都为自己终于上路了感到激动和高兴，也同样为前面的旅途而感到担忧。

source: The next morning we all set out on the short cross-country ride to Dover.
zh_cn: 次日上午，我们大家一起经过短途骑行穿越乡村前往多佛。

source: Unfortunately, neither of us is blessed with a good sense of direction, so we ended up getting a bit lost on the way.
zh_cn: 不幸的是我们的方向感都不强，结果在半路上迷了路，绕了不少的弯路。

source: A series of unintentional, if pretty, detours meant we made it with 10 minutes to spare - a blessing, in a way, as this made our final goodbyes mercifully short and sharp.
zh_cn: 尽管路上风景不错，但是到码头时离开船只有10分钟了。这样也不错，因为在这种情况下我们的告别只能很短暂了。

source: I shed some tears at the pain of the farewell; Matt remained stoically quiet.
zh_cn: 说再见时我掉了几滴眼泪，而迈特却是冷静依旧。

source: The reality of what we're attempting is sinking in. The talking and planning is over. Now the adventure can really begin.
zh_cn: 我们所期盼的一天已经来到了，计划和空谈已经结束，现在我们的探险真正开始了。
